# Data Engineering: Building Sparkify's Music Data Warehouse
#### Prepared by: Jose Carlos Moreno Ramirez
#### Institution: Western Governors University
#### Course: Data Wrangling - D309 
#### Project: Data Modeling with PostgreSQL
---

# ETL Processes
Use this notebook to develop the ETL process for each of your tables before completing the `etl.py` file to load the whole datasets.

In [1]:
#  1. First things first, say it with me, "importing libraries!"
import os
import glob # this package helps with file pattern matching
import psycopg2
import pandas as pd
from sql_queries import *
import numpy as np

In [2]:
#  2. Executing tables creation script
%run create_tables.py

In [3]:
#  3. Establishing connection to database
conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
cur = conn.cursor()

In [4]:
#  4. Defining function to get the directories of files
def get_files(filepath):
    all_files = []
    for root, dirs, files in os.walk(filepath):
        files = glob.glob(os.path.join(root,'*.json'))
        for f in files :
            all_files.append(os.path.abspath(f))
    
    return all_files

# Process `song_data`
In this first part, you'll perform ETL on the first dataset, `song_data`, to create the `songs` and `artists` dimensional tables.

Let's perform ETL on a single song file and load a single record into each table to start.
- Use the `get_files` function provided above to get a list of all song JSON files in `data/song_data`
- Select the first song in this list
- Read the song file and view the data

In [5]:
#  1. Fetching the directory of all the songs
song_files = get_files('data/song_data')

In [6]:
#  2. Indexing to grab the first file
filepath = song_files[0]

In [7]:
#  3. Reading data to DataFrame
df = pd.read_json(filepath, lines=True)

#  4. Analizando
df.head()

,artist_id,artist_latitude,artist_location,artist_longitude,artist_name,duration,num_songs,song_id,title,year
0,AR36F9J1187FB406F1,56.27609,Denmark,9.51695,Bombay Rockers,230.71302,1,SOBKWDJ12A8C13B2F3,Wild Rose (Back 2 Basics Mix),0

## #1: `songs` Table
#### Extract Data for Songs Table
- Select columns for song ID, title, artist ID, year, and duration
- Use `df.values` to select just the values from the dataframe
- Index to select the first (only) record in the dataframe
- Convert the array to a list and set it to `song_data`

In [8]:
#  1. Extracting the columns we want and converting into a list
song_data = df[['song_id', 'title', 'artist_id', 'year', 'duration']].values[0].tolist()

#  2. Analizando
song_data

['SOBKWDJ12A8C13B2F3',
 'Wild Rose (Back 2 Basics Mix)',
 'AR36F9J1187FB406F1',
 0,
 230.71302]

#### Insert Record into Song Table
Implement the `song_table_insert` query in `sql_queries.py` and run the cell below to insert a record for this song into the `songs` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `songs` table in the sparkify database.

In [9]:
#  4. Executing the insert query
cur.execute(song_table_insert, song_data)

#  5. Committing changes
conn.commit()

Run `test.ipynb` to see if you've successfully added a record to this table.

In [10]:
#  5. Testing
%run test.ipynb

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

## #2: `artists` Table
#### Extract Data for Artists Table
- Select columns for artist ID, name, location, latitude, and longitude
- Use `df.values` to select just the values from the dataframe
- Index to select the first (only) record in the dataframe
- Convert the array to a list and set it to `artist_data`

In [11]:
#  1. Extracting the columns we want and converting into a list
artist_data = df[["artist_id", "artist_name", "artist_location", "artist_latitude", "artist_longitude"]].values[0]

#  2. Analizando
artist_data

array(['AR36F9J1187FB406F1', 'Bombay Rockers', 'Denmark', 56.27609, 9.51695], dtype=object)

#### Insert Record into Artist Table
Implement the `artist_table_insert` query in `sql_queries.py` and run the cell below to insert a record for this song's artist into the `artists` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `artists` table in the sparkify database.

In [12]:
#  3. Executing the insert query
cur.execute(artist_table_insert, artist_data)

#  4. Committing changes
conn.commit()

Run `test.ipynb` to see if you've successfully added a record to this table.

In [13]:
#  5. Testing
%run test.ipynb

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

# Process `log_data`
In this part, you'll perform ETL on the second dataset, `log_data`, to create the `time` and `users` dimensional tables, as well as the `songplays` fact table.

Let's perform ETL on a single log file and load a single record into each table.
- Use the `get_files` function provided above to get a list of all log JSON files in `data/log_data`
- Select the first log file in this list
- Read the log file and view the data

In [14]:
#  1. Fetching the directory of all the log data
log_files = get_files("data/log_data")

In [15]:
#  2. Indexing to grab the first file
filepath = log_files[0]

In [16]:
#  3. Reading data to DataFrame
df = pd.read_json(filepath, lines = True)

#  4. Analizando
df.sample(5)

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
69,None,Logged In,Kate,F,1,Harrell,NaN,paid,"Lansing-East Lansing, MI",GET,Home,1.540473e+12,374,None,200,1542037813796,"""Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/5...",97
97,None,Logged In,Jayden,F,1,Duffy,NaN,free,"Seattle-Tacoma-Bellevue, WA",GET,Home,1.540146e+12,75,None,200,1542042467796,"""Mozilla/5.0 (iPhone; CPU iPhone OS 7_1_2 like...",76
185,Livvi Franc,Logged In,Austin,M,4,Rosales,380.99546,free,"New York-Newark-Jersey City, NY-NJ-PA",PUT,NextSong,1.541060e+12,371,Automatik,200,1542057101796,Mozilla/5.0 (Windows NT 6.1; rv:31.0) Gecko/20...,12
27,Feist,Logged In,Evelin,F,0,Ayala,184.94649,free,"Milwaukee-Waukesha-West Allis, WI",PUT,NextSong,1.541008e+12,318,My Moon My Man,200,1542017923796,Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; r...,34
106,Collective Soul,Logged In,Jacob,M,16,Klein,218.40934,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,294,Why Pt. 2,200,1542044103796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73

## #3: `time` Table
#### Extract Data for Time Table
- Filter records by `NextSong` action
- Convert the `ts` timestamp column to datetime
  - Hint: the current timestamp is in milliseconds
- Extract the timestamp, hour, day, week of year, month, year, and weekday from the `ts` column and set `time_data` to a list containing these values in order
  - Hint: use pandas' [`dt` attribute](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.html) to access easily datetimelike properties.
- Specify labels for these columns and set to `column_labels`
- Create a dataframe, `time_df,` containing the time data for this file by combining `column_labels` and `time_data` into a dictionary and converting this into a dataframe

In [17]:
#  1. Filtering records by 'NextSong' action function
df = df = df.query(" page == 'NextSong' ")

#  2. Analizando
df.sample(5)

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
42,Dwight Yoakam,Logged In,Ryan,M,1,Smith,239.30730,free,"San Jose-Sunnyvale-Santa Clara, CA",PUT,NextSong,1.541017e+12,491,You're The One,200,1542023125796,"""Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/5...",26
128,Nena Daconte,Logged In,Jacob,M,30,Klein,140.64281,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,294,En Que Estrella Estara,200,1542047569796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
79,Justin Bieber,Logged In,Chloe,F,1,Roth,220.89098,free,"Indianapolis-Carmel-Anderson, IN",PUT,NextSong,1.540699e+12,247,Somebody To Love,200,1542039024796,Mozilla/5.0 (Windows NT 6.1; rv:31.0) Gecko/20...,78
147,Cut Copy,Logged In,Jacob,M,45,Klein,71.49669,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,294,Visions,200,1542050131796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73
141,Touche Amore,Logged In,Jacob,M,41,Klein,136.95955,paid,"Tampa-St. Petersburg-Clearwater, FL",PUT,NextSong,1.540558e+12,294,Changing Lanes,200,1542049600796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",73

In [18]:
#  3. Converting the 'ts' column to datetime
t = pd.to_datetime(df["ts"]/1000, unit = 's')

#  4. Analizando
t.head()

1   2018-11-12 02:37:38.796000004
2   2018-11-12 02:37:44.796000004
3   2018-11-12 02:42:21.796000004
5   2018-11-12 02:45:52.796000004
6   2018-11-12 02:47:22.796000004
Name: ts, dtype: datetime64[ns]

In [19]:
#  5. Extracting the values we care about
time_data = np.transpose(np.array([df["ts"].values, t.dt.hour.values, t.dt.day.values, t.dt.week.values, t.dt.month.values, t.dt.year.values, t.dt.weekday.values]))

#  6. Labeling
column_labels = ("timestamp", "hour", "day", "week of year", "month", "year", "weekday")

In [20]:
#  7. Creating DataFrame to store time data for files
time_df = pd.DataFrame(data = time_data, columns = column_labels)

#  8. Analizando
time_df.sample(5)

         timestamp  hour  day  week of year  month  year  weekday
107  1542049600796    19   12            46     11  2018        0
79   1542044103796    17   12            46     11  2018        0
73   1542042785796    17   12            46     11  2018        0
46   1542035574796    15   12            46     11  2018        0
116  1542050658796    19   12            46     11  2018        0

#### Insert Records into Time Table
Implement the `time_table_insert` query in `sql_queries.py` and run the cell below to insert records for the timestamps in this log file into the `time` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `time` table in the sparkify database.

In [21]:
# My initial code ouputs did not work. I got an error message that said:
# Error: column "start_time" is of type timestamp without time zone but expression is of type bigint
# LINE 3: VALUES (1543109954796, 1, 25, 47, 11, 2018, 6)
#                 ^
# HINT:  You will need to rewrite or cast the expression.

#  9. So, I converted the bigint timestamps in the sql_queries.py script
for i, row in time_df.iterrows():
    cur.execute(time_table_insert, list(row))
    conn.commit()

Run `test.ipynb` to see if you've successfully added records to this table.

In [22]:
#  10. Testing
%run test.ipynb

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

## #4: `users` Table
#### Extract Data for Users Table
- Select columns for user ID, first name, last name, gender and level and set to `user_df`

In [23]:
#  1. Selecting the columns we want
user_df = df[["userId", "firstName", "lastName", "gender", "level"]]

#### Insert Records into Users Table
Implement the `user_table_insert` query in `sql_queries.py` and run the cell below to insert records for the users in this log file into the `users` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `users` table in the sparkify database.

In [24]:
#  2. Inserting records
for i, row in user_df.iterrows():
    cur.execute(user_table_insert, row)
    conn.commit()

Run `test.ipynb` to see if you've successfully added records to this table.

In [25]:
#  3. Testing
%run test.ipynb

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

## #5: `songplays` Table
#### Extract Data and Songplays Table
This one is a little more complicated since information from the songs table, artists table, and original log file are all needed for the `songplays` table. Since the log file does not specify an ID for either the song or the artist, you'll need to get the song ID and artist ID by querying the songs and artists tables to find matches based on song title, artist name, and song duration time.
- Implement the `song_select` query in `sql_queries.py` to find the song ID and artist ID based on the title, artist name, and duration of a song.
- Select the timestamp, user ID, level, song ID, artist ID, session ID, location, and user agent and set to `songplay_data`

#### Insert Records into Songplays Table
- Implement the `songplay_table_insert` query and run the cell below to insert records for the songplay actions in this log file into the `songplays` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `songplays` table in the sparkify database.

In [26]:
#  1. Inserting records into songplays table
for index, row in df.iterrows():

    # get songid and artistid from song and artist tables
    cur.execute(song_select, (row.song, row.artist, row.length))
    results = cur.fetchone()
    
    if results:
        songid, artistid = results
    else:
        songid, artistid = None, None

    # insert songplay record
    songplay_data = (row.ts,
                 row.userId,
                 row.level,
                 songid,
                 artistid,
                 row.sessionId,
                 row.location,
                 row.userAgent
                    )

    cur.execute(songplay_table_insert, songplay_data)
    conn.commit()

Run `test.ipynb` to see if you've successfully added records to this table.

In [27]:
#  2. Testing
%run test.ipynb

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.
 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

# Close Connection to Sparkify Database

In [28]:
#  1. Closing connection to database
conn.close()

# Implement `etl.py`
Use what you've completed in this notebook to implement `etl.py`.

### Citing References

1. [WGU Course Chatter](https://knowledge.udacity.com/?nanodegree=nd002-wgu-2&page=1&project=572&rubric=2500)
2. [Markdown Guide](https://www.markdownguide.org/basic-syntax)
3. [NumPy Transposition](https://numpy.org/doc/stable/reference/generated/numpy.transpose.html)

END OF NOTEBOOK